app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
  def index
    cookies["user_id"] = User.all.first.id