app/controllers/recipes_controller.rb

  def find_recipe
    @recipe = Recipe.find_by(id: params["id"])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 4]]

  def find_tags
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def index
    if params["keyword"].present?
      @recipes = Recipe.where("title LIKE ?", "%#{params[:keyword]}%")
    else
      @recipes = Recipe.all
    end
    @recipes = @recipes.order('date desc, stars desc, title asc')
    @recipes.each do |rcp|
      rcp.date = rcp.date.getlocal.strftime("%Y-%m-%d %H:%M:%S")
    end
    @recipes = @recipes.paginate(:page => params[:page], :per_page => 10)
---
SELECT "recipes".* FROM "recipes"  ORDER BY stars desc, date desc, title asc
SELECT  "recipes".* FROM "recipes"  ORDER BY title asc, stars desc, date desc, title asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "recipes"

  def show
    if @recipe == nil
      redirect_to recipes_url, notice: "recipe not found."
      return
    end
    @review = Review.new
    @reviews = @recipe.reviews.order('date desc')
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ? AND "reviews"."order" = 'date desc' LIMIT 1  [["recipe_id", 36]]

  def create
    @recipe = Recipe.new
    @recipe.transaction do
      @recipe.title = params[:title]
      @recipe.photo_url = params[:photo_url]
      @recipe.ingredients = params[:ingredients]
      @recipe.instruction = params[:instruction]
      @recipe.duration = params[:duration]
      @recipe.date = Time.new()
      @recipe.stars = params[:stars].to_i
      @recipe.num_reviews = 0
      @recipe.user_id = session[:user_id]
      @recipe.save
      @tags.each do |tag|
        if params["TagID#{tag.id}"].present?
          ct = Category.new
          ct.recipe_id = recipe.id
          ct.tag_id = tag.id
          ct.save
        end
      end
    end
    if @recipe.errors.any?
---
INSERT INTO "recipes" ("title", "photo_url", "ingredients", "instruction", "duration", "date", "stars", "num_reviews", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["title", "a"], ["photo_url", "b"], ["ingredients", "c"], ["instruction", "d"], ["duration", "20 min"], ["date", "2015-05-21 21:02:28.355917"], ["stars", 0], ["num_reviews", 0], ["user_id", 11]]
INSERT INTO "categories" ("recipe_id", "tag_id") VALUES (?, ?)  [["recipe_id", 68], ["tag_id", 62]]
SELECT "recipes".* FROM "recipes"  ORDER BY stars desc, date desc, title asc
SELECT COUNT(*) FROM "recipes"

  def edit
    tags = @recipe.tags
    @marked = {}
    tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "categories" ON "tags"."id" = "categories"."tag_id" WHERE "categories"."recipe_id" = ?  [["recipe_id", 69]]

  def update
    @recipe.transaction do
      @recipe.title = params[:title]
      @recipe.date = Time.new()
      @recipe.instruction = params[:instruction]
      @recipe.photo_url = params[:photo_url]
      @recipe.save

      @recipe.categories.each do |ct|
        ct.delete
      end

      @tags.each do |tag|
        if params["TagID#{tag.id}"].present?
          ct = Category.new
          ct.recipe_id = @recipe.id
          ct.tag_id = tag.id
          ct.save
        end
      end
    end
    if !@recipe.errors.any?
      redirect_to recipe_url(@recipe.id), notice: "Recipe updated"
      return
    else
      tags = @recipe.tags
      @marked = {}
      tags.each do |tag|
---
SELECT "categories".* FROM "categories" WHERE "categories"."recipe_id" = ?  [["recipe_id", 70]]
INSERT INTO "categories" ("recipe_id", "tag_id") VALUES (?, ?)  [["recipe_id", 70], ["tag_id", 62]]
SELECT "tags".* FROM "tags" INNER JOIN "categories" ON "tags"."id" = "categories"."tag_id" WHERE "categories"."recipe_id" = ?  [["recipe_id", 70]]

  def destroy
    @recipe.transaction do
      reviews = @recipe.reviews
      reviews.each do |review|
        review.delete
      end
      cts = @recipe.categories
      cts.each do |ct|
        ct.delete
      end
      @recipe.delete
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 58]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 59]]
SELECT "categories".* FROM "categories" WHERE "categories"."recipe_id" = ?  [["recipe_id", 68]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 28]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 4]]