app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("title", "comment", "date", "stars", "recipe_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "a"], ["comment", "b"], ["date", "2015-05-21 17:08:56.213132"], ["stars", 0], ["recipe_id", 48], ["user_id", 9]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 47]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  ORDER BY date desc  [["recipe_id", 47]]
SELECT SUM("reviews"."stars") FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 47]]
UPDATE "recipes" SET "num_reviews" = ?, "stars" = ? WHERE "recipes"."id" = ?  [["num_reviews", 1], ["stars", 17], ["id", 47]]
---
  def create
    @review = Review.new
    @review.title = params[:title]
    @review.comment = params[:comment]
    @review.date = Time.new()
    @review.stars = params[:stars].to_i
    @review.recipe_id = params[:recipe_id]
    @review.user_id = session[:user_id]
    @review.transaction do
      @review.save
      recipe = Recipe.find_by(:id => params[:recipe_id])
      recipe.num_reviews += 1
      recipe.stars = Review.where(:recipe_id => recipe.id).sum(:stars) / recipe.num_reviews
      recipe.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 35]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 35]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 47]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IS NULL LIMIT 1
SELECT SUM("reviews"."stars") FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 47]]
UPDATE "recipes" SET "num_reviews" = ?, "stars" = ? WHERE "recipes"."id" = ?  [["num_reviews", 2], ["stars", 1], ["id", 47]]
---
  def destroy
    review = Review.find_by(id: params[:id])
    review.transaction do
      review.delete
      recipe = Recipe.find_by(:id => params[:recipe_id])
      recipe.num_reviews -= 1
      recipe.stars = Review.where(:recipe_id => recipe.id).sum(:stars) / recipe.num_reviews
      recipe.save