app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "ls"]]
---
  def create
    user = User.find_by(user_name: params[:user_name])