app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 61]]
SELECT  "recipes".* FROM "recipes" INNER JOIN "categories" ON "recipes"."id" = "categories"."recipe_id" WHERE "categories"."tag_id" = ? LIMIT 2 OFFSET 0  [["tag_id", 62]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "categories" ON "recipes"."id" = "categories"."recipe_id" WHERE "categories"."tag_id" = ?  [["tag_id", 61]]
---
  def show
    @tag = Tag.find_by(id: params[:id])
    @recipes = @tag.recipes.paginate(:page => params[:page], :per_page => 10)