app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password", "email", "gender", "create_date", "photo_url", "background") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_name", "ls"], ["password", "ls"], ["email", "l@example.org"], ["gender", "Mail"], ["create_date", "2015-05-21 20:53:38.835028"], ["photo_url", "asdf"], ["background", "few"]]
---
  def create
    @user = User.new
    @user.user_name = params[:user_name]
    @user.password = params[:password]
    @user.email = params[:email]
    @user.gender = params[:gender]
    @user.create_date = Time.now

UPDATE "users" SET "user_name" = ?, "background" = ? WHERE "users"."id" = ?  [["user_name", "ls"], ["background", "baewfwet"], ["id", 16]]
---
  def update
    @user.user_name = params[:user_name]
    @user.email = params[:email]
    @user.gender = params[:gender]
    @user.photo_url = params[:photo_url]
    @user.background = params[:background]
    puts @user.password
    if @user.save

UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$4Lpdcr/Pu4JfDAgnkqHct.Vcf8ClCpef7zFOTXQoNqJyCl7Iatqay"], ["id", 16]]
---
  def update_password
    if @user.authenticate(params[:old_password])
      if params[:new_password] != params[:confirm_password]
        flash[:notice] = "Two passwords do not match."
        render "edit_password"
        return
      end
      @user.password = params[:new_password]
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "samliu@uchicago.edu"]]
SELECT  1 AS one FROM "users" WHERE ("users"."email" = 'samliu@uchicago.edu' AND "users"."id" != 21) LIMIT 1
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$mgNQ4VDSBM8p1MQ4PghmhOWXv6HGWFajXBZ.S6PZVxLsduQdtWRt2"], ["id", 21]]
---
  def send_password
    to = params["email_address"]
    user = User.find_by(:email => to)
    if !user.present?
      redirect_to forget_password_path, notice: "Email not found"
      return
    end

    user.password = generate_password
    if !user.save